// !! 标准模板库

'STL (standard template library, 标准模板库) 是 C++ 标准库的核心, 它深刻影响了标准库的整体结构'。

STL 是一个泛型(generic)程序库,提供一系列软件方案,'利用先进、高效的算法来管理数据'。程序员无须了解 STL 的原理,便可享受数据结构和算法领域中的这一革新
成果。

从程序员的角度看来, STL 是由一些可适应不同需求的集合类 (collection class) 和一些能够在这些数据集合上运作的算法构成。STL 内的所有组件都由 template
(模板) 构成, 所以其元素可以是任意类型。'更妙的是, STL 建立了一个框架(framework), 在此框架下你可以提供其他集合类或算法, 与现有的组件搭配共同运作'。

'总之, STL 赋予了 C++ 新的抽象层次'。抛开 dynamic array (动态数组)、linked list(链表)、binary tree(二叉树)、hash table(散列)之类的东西吧,
也不必再烦心各种 search (查找)算法了。你只需使用恰当的集合类, 然后调用其成员函数和(或)算法来处理数据,就万事大吉。

'当然, 如此的灵活性并非免费午餐, 代价总是有的。首要的一点是, STL 并不好懂'。






